/****************************************************************************
**
** Copyright (C) 2010-2014 Kazo Vision. (http://www.kazovision.com)
** All rights reserved.
**
****************************************************************************/
#include "dataprocess.h" 



/****************************************
*函数名称:Init_dataprocess 
*输    入:无
*输    出:无
*功    能:初始化数据处理要用到的数据
******************************************/

void Init_Dataprocess(void)
{	 	
	
}

/****************************************
*函数名称: Analyze_Time0data
*输    入:无
*输    出:无
*功    能:定时器到时间后 对采集的数据进行处理
******************************************/
VOID Analyze_Signaldata(VOID)
{ 

}


void Analyze_time1(void)
{
}



/****************************************
*函数名称: Analyze_Rx0data
*输    入:无
*输    出:无
*功    能:对串口0接收的数据进行分析
******************************************/
void Analyze_Rx0data(void)
{
 	 
}
/****************************************
*函数名称:Process_Rx0data
*输    入: 
					data  
					typeerr	指令错误类型
*输    出:无
*功    能:处理分离出来的数据
******************************************/
void Process_Rx0data(UINT8 data[],UINT8 typeerr) 
{
		
}

/****************************************
*函数名称: Analyze_Rx1data
*输    入:无
*输    出:无
*功    能:对串口1接收的数据进行分析
******************************************/
void Analyze_Rx1data(void)
{
  
}
/****************************************
*函数名称:Process_Rx1data
*输    入: 
					data  
					typeerr	指令错误类型
*输    出:无
*功    能:处理分离出来的数据
******************************************/
void Process_Rx1data(UINT8 data[],UINT8 typeerr) 
{
	
}

/****************************************
*函数名称:Process_Rx1data
*输    入: 
					data  
					typeerr	指令错误类型
*输    出:无
*功    能:处理分离出来的数据
******************************************/


